[
    [
        {
            "likes": "9.4K",
            "username": "@J.a2411",
            "nickname": "J.",
            "post_num": "Posts (2K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "GOP candidates unworried about Iowa turnout as they face record cold caucus temperatures",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "President Biden could wind up being the first candidate in US history to win all 50 States in a General Election for President of the United States, if Trump stays in the race. Wouldn't that be cool.",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "I predict Iowa will go for Biden in November. This is just a GOP thing right now. Very low energy. Even conservatives don't like Trump.",
                            "type": "Replied to breathe"
                        },
                        {
                            "comment_text": "If Trump winds up being the GOP candidate, President Biden wins another landslide victory in November. Simple as that.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "19 GOP Former Members Of Congress Issue Stark Call To Courts On Trump",
                        "outlet_link": "https://www.huffpost.com",
                        "outlet_name": "HuffPost"
                    },
                    "comments": [
                        {
                            "comment_text": "And remember, No One Is Above The Law!",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "You don't have a Republic without Democracy.",
                            "type": "Replied to bighit"
                        },
                        {
                            "comment_text": "The longer Trump stays in the race, the better it is for President Biden getting re-elected. Trump will get crushed in the General Election. We are witnessing the destruction of the GOP thanks to Trump.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Poll: Trump thumping Biden in Michigan — but losing to Whitmer",
                        "outlet_link": "https://www.politico.com/",
                        "outlet_name": "Politico"
                    },
                    "comments": [
                        {
                            "comment_text": "You don't see Trump signs anywhere in Michigan. Conservatives are embarrassed of Trump. Biden will easily win Michigan.",
                            "type": "Replied to T"
                        },
                        {
                            "comment_text": "Trump is washed up. He should drop out of the race to focus on his pending Prison term of office.",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "Nobody has the experience or expertise as President Biden. That's why he wins, and as you can see America is winning too.",
                            "type": "Replied to FromSanJose"
                        },
                        {
                            "comment_text": "She'd make a fine President in 2028.",
                            "type": "Replied to Jeffrey"
                        },
                        {
                            "comment_text": "Only if Trump somehow steals another election.",
                            "type": "Replied to MidiMagic"
                        },
                        {
                            "comment_text": "Polls don't mean jack. Michigan is solid Blue after what Trump had done to the country. Whitmer would make fine President after President Biden's second term ends in 2028.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump legal news brief: In reversal, Judge Engoron says Trump can’t give his own closing argument in fraud trial",
                        "outlet_link": "https://news.yahoo.com/",
                        "outlet_name": "Yahoo News"
                    },
                    "comments": [
                        {
                            "comment_text": "This is about the time Trump takes off with his family, and defects to Russia.",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "Trump should drop out of the race, and prepare for his inevitable Prison sentence.",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "This shouldn't even be debatable at this point. Lock him up already!",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "Trump's endorsement is the kiss of death though.",
                            "type": "Replied to The"
                        },
                        {
                            "comment_text": "No one is above the law! Lock him up!!!",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Judges skeptical of Trump's immunity claim in election subversion case",
                        "outlet_link": "https://www.reuters.com/",
                        "outlet_name": "Reuters"
                    },
                    "comments": [
                        {
                            "comment_text": "Lock him up!",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "No one is above the law! Trump is toast.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Biden campaigns in South Carolina as he struggles to build Black voter support",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "All black voters have to do is watch one Republican rally. That will bring them to vote President Biden!",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "He's done alot more for them than Republicans will ever do. If it were up to Republicans, they'd bring back slavery.",
                            "type": "Replied to StephenB"
                        },
                        {
                            "comment_text": "Who are black voters going to vote for if not Biden? Trump? I seriously doubt that!",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Jim Jordan endorses Trump-backed Bernie Moreno in messy Ohio Senate primary",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "Of course. Because Jordan is an insurrectionist Traitor to the United States.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Iowa's Christian conservatives follow their faith when voting, and some say it leads them to Trump",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "Trump is the furthest thing from Christian behavior.",
                            "type": "Posted"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "26.6K",
            "username": "@DemsRule",
            "nickname": "DemsRule",
            "post_num": "Posts (7.8K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "Trump moves to dismiss Georgia election case on presidential immunity grounds",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "Well, let us presume that, with all of the evidence we have from the republicans who are now stating the truth about his crimes, he needs to go to jail just like any other citizen of the USA would have done by now.",
                            "type": "Replied to Larry"
                        },
                        {
                            "comment_text": "This is what happens when stupidity takes over the minds of those who put him in office the first time and are willing to do it yet again.",
                            "type": "Replied to Descent"
                        },
                        {
                            "comment_text": "If he is that clueless, what in the world was he doing as the President of the United States? Wake up MAGAtes.",
                            "type": "Replied to DaWei"
                        },
                        {
                            "comment_text": "That MAGAtes truly believe that Trump is above the law is very disturbing and speaks volumes about who they are.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump's immunity claim gets skeptical reaction at appeals court",
                        "outlet_link": "http://cbs11tv.com/",
                        "outlet_name": "CBS-Dallas"
                    },
                    "comments": [
                        {
                            "comment_text": "Trump is immune from the truth, intelligence and common sense.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump lawyers say he should be shielded from criminal charges",
                        "outlet_link": "https://www.dcnewsnow.com",
                        "outlet_name": "WDVM"
                    },
                    "comments": [
                        {
                            "comment_text": "Dictators do that. This whole debacle is insane.",
                            "type": "Replied to jay"
                        },
                        {
                            "comment_text": "That is what they say because Trump's cult members are paying them to do so. I say they should be disbarred from practicing the law they are not willing to follow.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "With Trump present in court, judges express skepticism of his immunity claims",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press Videos"
                    },
                    "comments": [
                        {
                            "comment_text": "In Trump's eyes, he can do no wrong. This is a very disturbed individual who will take the USA down if he is elected. And we thought we were the laughing stock of the world before this fiasco.",
                            "type": "Replied to Ted"
                        },
                        {
                            "comment_text": "Skepticism? How about Trump and his attornys being laughed out of the hearing for their stupidity of the law. Either that or knowingly lying about the law and the attorneys being barred from practising law.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "5 Takeaways From the Appeals Court Hearing on Trump’s Immunity Claim",
                        "outlet_link": "https://www.nytimes.com/",
                        "outlet_name": "The New York Times"
                    },
                    "comments": [
                        {
                            "comment_text": "So he is immune from any crime he commits like having the Navy seals execute anyone of his choosing? The sixth take away is him from ever holding public office.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump’s immunity claim gets frosty reception at appeals court",
                        "outlet_link": "https://www.politico.com/",
                        "outlet_name": "Politico"
                    },
                    "comments": [
                        {
                            "comment_text": "Blatantly insane statements from Trump's attorneys should receive a frosty reception.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Gov. Tate Reeves pledges to focus on economy, healthcare sector, as he is sworn in Tuesday",
                        "outlet_link": "https://www.clarionledger.com",
                        "outlet_name": "The Clarion Ledger"
                    },
                    "comments": [
                        {
                            "comment_text": "They are moving to a blue state where sanity and honor are available.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Defense Secretary Lloyd Austin diagnosed with prostate cancer",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "Nobody's business but his.",
                            "type": "Posted"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "6.1K",
            "username": "@Faye754",
            "nickname": "Faye",
            "post_num": "Posts (3.6K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "Lauren Boebert's ex-husband was arrested and charged with assault after their showdown at a restaurant",
                        "outlet_link": "https://www.businessinsider.com/",
                        "outlet_name": "Business Insider"
                    },
                    "comments": [
                        {
                            "comment_text": "The only thing saving America right now are the non-violent folks who know & love our Constitution.\n\nBobert is not one of those.\n\nYou can solve this problem by actually reading the Constitution & supporting it.",
                            "type": "Replied to Motor"
                        },
                        {
                            "comment_text": "Such nice people. Vote blue.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "GOP candidates unworried about Iowa turnout as they face record cold caucus temperatures",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "The GOP doesn't care about voter turnout. The less people vote, the better their chances.\n\nYes, upside down.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Appeals Court Seems Skeptical of Trump’s Immunity Claim",
                        "outlet_link": "https://www.nytimes.com/",
                        "outlet_name": "The New York Times"
                    },
                    "comments": [
                        {
                            "comment_text": "Apparently. They don't care about the truth or what is good for the country.",
                            "type": "Replied to 2"
                        },
                        {
                            "comment_text": "Trump's lawyers were only blowing smoke. What they said didn't make sense.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump asks Maine judge for pause to let US Supreme Court rule on ballot access",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "If you want to be on the ballot, don't lead an insurrection. Side with your VP instead of the mob that wants to hang him.\n\nFunny, you tried to get Obama off the ballot for no reason at all.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Cheney says Stefanik calling Jan. 6 prisoners hostages a ‘disgrace’",
                        "outlet_link": "https://thehill.com/",
                        "outlet_name": "The Hill"
                    },
                    "comments": [
                        {
                            "comment_text": "Most Republican women in office aren't like any woman I'd have as a friend. I pity they're spouses & kids.\n\nCheney, on the other hand, is a role model for men & women all over the world.",
                            "type": "Replied to Sherry"
                        },
                        {
                            "comment_text": "Stefanik is the new MGT/Bobert. Note how many headlines she's making lately.\n\nAll heat, no light.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "RNC supports Trump in 14th Amendment case at the Supreme Court",
                        "outlet_link": "https://www.politico.com/",
                        "outlet_name": "Politico"
                    },
                    "comments": [
                        {
                            "comment_text": "Biden rocked his speech today. Trump will never be profound or be able to bring America to it's best.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump received at least $7.8 million in payments from foreign governments as president, House Democrats say",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "The emoluments clause: we all knew Trump was violating it all along.\n\nLock him up and all the Republican lawmakers who turned a blind eye.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Johnson Visits Border, Turning Up Heat on Biden for an Immigration Deal",
                        "outlet_link": "https://www.nytimes.com/",
                        "outlet_name": "The New York Times"
                    },
                    "comments": [
                        {
                            "comment_text": "Such evils! Leave these people alone & write an immigration reform bill you can live with. You whine & moan about what isn't working, but you won't use the power you have to fix it to fix it.",
                            "type": "Posted"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "4.1K",
            "username": "@johns_u_OkVd25lwogd6",
            "nickname": "john s",
            "post_num": "Posts (1.6K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "GOP candidates unworried about Iowa turnout as they face record cold caucus temperatures",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "Perfect day for Donnie to play 18 holes of golf at the Desmoines Country Club in is white bermuda shorts.",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "Tht's a clue that it will be a cold day in **** if TRump is reelected",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Alleged Epstein victim stands by claim paedophile kept sex tapes",
                        "outlet_link": "http://www.independent.co.uk/",
                        "outlet_name": "The Independent"
                    },
                    "comments": [
                        {
                            "comment_text": "When will the pics of Donnie and a sheep be released?",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Kendall Jenner Lounges on the Beach in an Itsy Bitsy, Green String swimsuit",
                        "outlet_link": "http://www.elle.com/",
                        "outlet_name": "Elle"
                    },
                    "comments": [
                        {
                            "comment_text": "Next week's news will be pics of Donald Trump wearing the same bathing suit and looking sexier that is KGB wife Melania.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Defendant in Trump's Georgia case accuses DA, prosecutor of 'improper' relationship",
                        "outlet_link": "https://www.reuters.com/",
                        "outlet_name": "Reuters"
                    },
                    "comments": [
                        {
                            "comment_text": "Doesn't this guy ever get laryngitus?",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Jimmy Kimmel Slams Aaron Rodgers’ Claim About Jeffrey Epstein Connection: ‘Your Reckless Words Put My Family in Danger’",
                        "outlet_link": "http://variety.com",
                        "outlet_name": "Variety"
                    },
                    "comments": [
                        {
                            "comment_text": "Does Aaron Rodgers lay for the Dodgers? I hear he's a switch hitter.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Missing teenager found in man's bedroom under trap door",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "According to the Republican National Committee this is a Romeo and Juliet story.",
                            "type": "Posted"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "4.1K",
            "username": "@johns_u_OkVd25lwogd6",
            "nickname": "john s",
            "post_num": "Posts (1.6K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "GOP candidates unworried about Iowa turnout as they face record cold caucus temperatures",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "Perfect day for Donnie to play 18 holes of golf at the Desmoines Country Club in is white bermuda shorts.",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "Tht's a clue that it will be a cold day in **** if TRump is reelected",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Alleged Epstein victim stands by claim paedophile kept sex tapes",
                        "outlet_link": "http://www.independent.co.uk/",
                        "outlet_name": "The Independent"
                    },
                    "comments": [
                        {
                            "comment_text": "When will the pics of Donnie and a sheep be released?",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Kendall Jenner Lounges on the Beach in an Itsy Bitsy, Green String swimsuit",
                        "outlet_link": "http://www.elle.com/",
                        "outlet_name": "Elle"
                    },
                    "comments": [
                        {
                            "comment_text": "Next week's news will be pics of Donald Trump wearing the same bathing suit and looking sexier that is KGB wife Melania.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Defendant in Trump's Georgia case accuses DA, prosecutor of 'improper' relationship",
                        "outlet_link": "https://www.reuters.com/",
                        "outlet_name": "Reuters"
                    },
                    "comments": [
                        {
                            "comment_text": "Doesn't this guy ever get laryngitus?",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Jimmy Kimmel Slams Aaron Rodgers’ Claim About Jeffrey Epstein Connection: ‘Your Reckless Words Put My Family in Danger’",
                        "outlet_link": "http://variety.com",
                        "outlet_name": "Variety"
                    },
                    "comments": [
                        {
                            "comment_text": "Does Aaron Rodgers lay for the Dodgers? I hear he's a switch hitter.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Missing teenager found in man's bedroom under trap door",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "According to the Republican National Committee this is a Romeo and Juliet story.",
                            "type": "Posted"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "31.9K",
            "username": "@Joe73381",
            "nickname": "Joe",
            "post_num": "Posts (15.1K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "Trump warns of ‘bedlam’ if criminal cases bar him from White House",
                        "outlet_link": "https://www.theguardian.com/international",
                        "outlet_name": "The Guardian"
                    },
                    "comments": [
                        {
                            "comment_text": "\"Bedlam\" in its dreams. What there'll be is a collective sigh of relief that it's gone.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Zelensky appeals for air defence systems at start of Baltic tour",
                        "outlet_link": "https://nordot.app/-/units/601684660556563553",
                        "outlet_name": "dpa international"
                    },
                    "comments": [
                        {
                            "comment_text": "\"Appeals for..\" = Begs.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Cannabis products may harbor fungal toxins harmful to human health, but regulations are uneven or nonexistent",
                        "outlet_link": "https://theconversation.com/us",
                        "outlet_name": "The Conversation"
                    },
                    "comments": [
                        {
                            "comment_text": "Everything you eat has these same microorganisms, and their potential toxins, in and on it. Singling out Cannabis in this regard is just more of the \"Reefer Madness\" anti-Cannabis propaganda sponsored by the for-profit",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "GOP candidates unworried about Iowa turnout as they face record cold caucus temperatures",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "NO republican is worth going out in the cold to vote for. Stay home, wait for November, then VOTE BLUE!",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Defense Ministry terminates contracts with Hrynkevych after corruption scandal",
                        "outlet_link": "https://english.nv.ua/",
                        "outlet_name": "The New Voice of Ukraine"
                    },
                    "comments": [
                        {
                            "comment_text": "No non-corrupt Ukrainian businesses for the corrupt Ukrainian government to do business with. All Ukraine is busy embezzling the windfall of US tax dollars being sent their way.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "US Rep. Greg Pence of Indiana, former VP Mike Pence's older brother, won't seek reelection",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "Overtly religious, conservative old white men should NOT be making decisions that effect the rest of us. Period.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "First US moon landing mission in decades launches with NASA science, humans remains on board",
                        "outlet_link": "https://www.cnn.com/",
                        "outlet_name": "CNN"
                    },
                    "comments": [
                        {
                            "comment_text": "Ignore you.",
                            "type": "Replied to Sam"
                        },
                        {
                            "comment_text": "First US moon crash in decades, you mean, right?",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "Once again, the sentiments of Native Americans get ignored by the whiteman, their beliefs mocked.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Private Peregrine moon lander suffers anomaly after historic Vulcan rocket launch, Astrobotic says",
                        "outlet_link": "https://www.space.com/",
                        "outlet_name": "Space"
                    },
                    "comments": [
                        {
                            "comment_text": "More expensive junk trashing the moon.",
                            "type": "Posted"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "9.4K",
            "username": "@J.a2411",
            "nickname": "J.",
            "post_num": "Posts (2K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "GOP candidates unworried about Iowa turnout as they face record cold caucus temperatures",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "President Biden could wind up being the first candidate in US history to win all 50 States in a General Election for President of the United States, if Trump stays in the race. Wouldn't that be cool.",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "I predict Iowa will go for Biden in November. This is just a GOP thing right now. Very low energy. Even conservatives don't like Trump.",
                            "type": "Replied to breathe"
                        },
                        {
                            "comment_text": "If Trump winds up being the GOP candidate, President Biden wins another landslide victory in November. Simple as that.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "19 GOP Former Members Of Congress Issue Stark Call To Courts On Trump",
                        "outlet_link": "https://www.huffpost.com",
                        "outlet_name": "HuffPost"
                    },
                    "comments": [
                        {
                            "comment_text": "And remember, No One Is Above The Law!",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "You don't have a Republic without Democracy.",
                            "type": "Replied to bighit"
                        },
                        {
                            "comment_text": "The longer Trump stays in the race, the better it is for President Biden getting re-elected. Trump will get crushed in the General Election. We are witnessing the destruction of the GOP thanks to Trump.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Poll: Trump thumping Biden in Michigan — but losing to Whitmer",
                        "outlet_link": "https://www.politico.com/",
                        "outlet_name": "Politico"
                    },
                    "comments": [
                        {
                            "comment_text": "You don't see Trump signs anywhere in Michigan. Conservatives are embarrassed of Trump. Biden will easily win Michigan.",
                            "type": "Replied to T"
                        },
                        {
                            "comment_text": "Trump is washed up. He should drop out of the race to focus on his pending Prison term of office.",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "Nobody has the experience or expertise as President Biden. That's why he wins, and as you can see America is winning too.",
                            "type": "Replied to FromSanJose"
                        },
                        {
                            "comment_text": "She'd make a fine President in 2028.",
                            "type": "Replied to Jeffrey"
                        },
                        {
                            "comment_text": "Only if Trump somehow steals another election.",
                            "type": "Replied to MidiMagic"
                        },
                        {
                            "comment_text": "Polls don't mean jack. Michigan is solid Blue after what Trump had done to the country. Whitmer would make fine President after President Biden's second term ends in 2028.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump legal news brief: In reversal, Judge Engoron says Trump can’t give his own closing argument in fraud trial",
                        "outlet_link": "https://news.yahoo.com/",
                        "outlet_name": "Yahoo News"
                    },
                    "comments": [
                        {
                            "comment_text": "This is about the time Trump takes off with his family, and defects to Russia.",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "Trump should drop out of the race, and prepare for his inevitable Prison sentence.",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "This shouldn't even be debatable at this point. Lock him up already!",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "Trump's endorsement is the kiss of death though.",
                            "type": "Replied to The"
                        },
                        {
                            "comment_text": "No one is above the law! Lock him up!!!",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Judges skeptical of Trump's immunity claim in election subversion case",
                        "outlet_link": "https://www.reuters.com/",
                        "outlet_name": "Reuters"
                    },
                    "comments": [
                        {
                            "comment_text": "Lock him up!",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "No one is above the law! Trump is toast.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Biden campaigns in South Carolina as he struggles to build Black voter support",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "All black voters have to do is watch one Republican rally. That will bring them to vote President Biden!",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "He's done alot more for them than Republicans will ever do. If it were up to Republicans, they'd bring back slavery.",
                            "type": "Replied to StephenB"
                        },
                        {
                            "comment_text": "Who are black voters going to vote for if not Biden? Trump? I seriously doubt that!",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Jim Jordan endorses Trump-backed Bernie Moreno in messy Ohio Senate primary",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "Of course. Because Jordan is an insurrectionist Traitor to the United States.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Iowa's Christian conservatives follow their faith when voting, and some say it leads them to Trump",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "Trump is the furthest thing from Christian behavior.",
                            "type": "Posted"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "6.3K",
            "username": "@Scott67323",
            "nickname": "Scott",
            "post_num": "Posts (1.3K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "Nevada man seen on video attacking judge faces attempted murder charge",
                        "outlet_link": "https://www.cnn.com/",
                        "outlet_name": "CNN"
                    },
                    "comments": [
                        {
                            "comment_text": "I guess she made the right call.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "GOP candidates unworried about Iowa turnout as they face record cold caucus temperatures",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "From the perspective of an independent... the next time you are reading article comments take notice of the tone of the left-leaning comments vs the right. The left writes with drive and visceral while the right comments are more matter-of-fact.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Israeli Forces Stood by as Settlers Killed Palestinian Teen, Report Says",
                        "outlet_link": "http://www.thedailybeast.com",
                        "outlet_name": "The Daily Beast"
                    },
                    "comments": [
                        {
                            "comment_text": "Yeah right",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "AI can allow us to 'talk' to the dead, but is that healthy?",
                        "outlet_link": "https://news.yahoo.com/tagged/360/",
                        "outlet_name": "Yahoo News 360"
                    },
                    "comments": [
                        {
                            "comment_text": "Sounds like you are the lonely one bud",
                            "type": "Replied to Doc"
                        },
                        {
                            "comment_text": "This is pretty awesome. Of course there are situations were this could be mentally harmful to folks but there are plenty situations where this is absolutely wonderful. Think of a man who has terminal cancer AND a pregnant wife. Or what about",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "WATCH: Bills Mafia welcomes team back home at Buffalo airport",
                        "outlet_link": "https://billswire.usatoday.com/",
                        "outlet_name": "Bills Wire"
                    },
                    "comments": [
                        {
                            "comment_text": "C'mon Josh. Put on a coat and go shake some hands. My cousin was in that crowd. Go Bills!",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Brittany Mahomes Outed By Hotel Staff For Being ‘Genuinely Unpleasant’",
                        "outlet_link": "https://theblast.com/",
                        "outlet_name": "TheBlast"
                    },
                    "comments": [
                        {
                            "comment_text": "I would fire the crap out of that employee. Her stupid post not only cost that hotel the Mahomes business, but likely any other Chief or even NFL player's business indefinitely. I would say they should sue her but she likely doesn't",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "A California city's transformation from 'murder capital' of the U.S. to zero homicides",
                        "outlet_link": "https://www.latimes.com/",
                        "outlet_name": "LA Times"
                    },
                    "comments": [
                        {
                            "comment_text": "Take note mayors of the US. If you want to be known as the mayor that \"cleaned up this town\" all you need is some gentrification. Open up a Starbucks and you are halfway there.",
                            "type": "Posted"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "13.8K",
            "username": "@RichardD919",
            "nickname": "Richard",
            "post_num": "Posts (4.5K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "Lawyers may face discipline for criticizing a judge's ruling in discrimination case",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "I don't know enough about the law but I always though that in a jury the jury determined what the out come of the trial was, why was the judge changing it? Doesn't the jury determine it, why even ask us to serve?\n\nI do understand",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "GOP candidates unworried about Iowa turnout as they face record cold caucus temperatures",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "It really doesn't matter if anyone turns out, even though I'm no longer Republican, Trump will win Nikki will come in 2nd because, even now DeSantis cares more about attending this caucus when his emergency in\n\nthe panhandle is",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Iowa pastors denounce ‘God Made Trump’ video",
                        "outlet_link": "https://www.deseret.com/",
                        "outlet_name": "Deseret News"
                    },
                    "comments": [
                        {
                            "comment_text": "We may have freedom of speech here in the USA but I don't believe anyone can personally speak for God in who He would support or vote for but I don't believe he would based just on how many lies he's told costing peoples lives.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "A Wisconsin Supreme Court justice says 'we're going to lose this battle' for democracy to 'a bunch of insurrectionists' if public officials don't speak out about the threats they've received",
                        "outlet_link": "https://www.insider.com/",
                        "outlet_name": "Business Insider"
                    },
                    "comments": [
                        {
                            "comment_text": "ExPresident Trump should have wound up in jail and in my eye is a spy when he took and then did not return those still classified document to the Government when he said he did and didn't. A spy is a spy, I also believe President Biden should",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Congresswoman Lauren Boebert's ex-husband arrested, facing charges",
                        "outlet_link": "https://www.cbsnews.com/",
                        "outlet_name": "CBS News"
                    },
                    "comments": [
                        {
                            "comment_text": "I think it's time to send Boebert, I first gave her some respect, not anymore. I never did give Maggie any respect she didn't know anything about anything and she still doesn't.",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "I think someone needs to proof read news medias before printing, there's just no care taken anymore, it's becoming more of a rag, I guess you would refer to it as trash when done like this.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "As DeSantis and Haley face off in Iowa GOP debate, urgency could spark fireworks",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "DeSantis is the most corrupt Governor I've ever seen so you can imagine what kind of a President he'd made.",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "DeSantis left an emergency storm situation in the Florida panhandle situation but didn't care, he's more interested in his election than paying attention to his oath and this is the reason why there was a law in place which he had changed",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Family of woman shot during January 6 Capitol riot sues US government, seeking $30 million",
                        "outlet_link": "https://www.usatoday.com/news/",
                        "outlet_name": "USA TODAY"
                    },
                    "comments": [
                        {
                            "comment_text": "She was shot and killed while breaking and entering our Capitol in a hostile takeover disrupting a legal process of Congress of her own accord, this suit shouldn't even be heard.",
                            "type": "Posted"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "32.4K",
            "username": "@MyComment555",
            "nickname": "My Comment",
            "post_num": "Posts (11.4K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "Hunter Biden makes surprise appearance on Capitol Hill",
                        "outlet_link": "https://www.cbsnews.com/",
                        "outlet_name": "CBS News"
                    },
                    "comments": [
                        {
                            "comment_text": "Pretty funny seeing Gym Jordan in that picture.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "DeSantis and Haley go head to head: How to watch the fifth Republican presidential debate",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "I'll be voting blue in the general election anyway",
                            "type": "Replied to dennisz"
                        },
                        {
                            "comment_text": "As a Florida resident, I have to say I'll take Nikki Haley over DeSantis any day",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "As DeSantis and Haley face off in Iowa GOP debate, urgency could spark fireworks",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "Being a Florida native, I have to say I would have to take Haley but I'm still voting blue",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Congresswoman Lauren Boebert's ex-husband arrested, facing charges",
                        "outlet_link": "https://www.cbsnews.com/",
                        "outlet_name": "CBS News"
                    },
                    "comments": [
                        {
                            "comment_text": "I just wanted to ask, why is this news?",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "GOP candidates unworried about Iowa turnout as they face record cold caucus temperatures",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "If you love the ladies and the United States, vote blue",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "GOP senators slap down Trump on Jan. 6 ‘hostages’",
                        "outlet_link": "https://thehill.com/",
                        "outlet_name": "The Hill"
                    },
                    "comments": [
                        {
                            "comment_text": "The sooner Trump is jailed the better",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump suggests unauthorized migrants will vote. The idea stirs his base, but ignores reality",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "Trump did say he loves the uneducated",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Everything you need to know about Republicans moving forward on impeaching Homeland Security Secretary Alejandro Mayorkas",
                        "outlet_link": "https://www.businessinsider.com/",
                        "outlet_name": "Business Insider"
                    },
                    "comments": [
                        {
                            "comment_text": "Just complete and utter confusion and destruction from a MAGA crowd.",
                            "type": "Posted"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "9.8K",
            "username": "@StopThisChaos",
            "nickname": "Stop This Chaos",
            "post_num": "Posts (2.1K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "GOP candidates unworried about Iowa turnout as they face record cold caucus temperatures",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "With Trump and his militant supporters, the caucus format yields an unreliable result. There is a good chance that there could be personal retribution against those who openly support a candidate other than Trump. Secret ballot is used for a",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "How an animated character named Marlon could help Trump win Iowa's caucuses",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "That is in his plan.",
                            "type": "Replied to The"
                        },
                        {
                            "comment_text": "The goal is not to make America great, rather to make it subservient.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump plans to seek Supreme Court review of Jan. 6 civil cases in another push for immunity",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "The Supreme Court needs to step up its processing of cases and stop playing Trump's delay game. The courts are allowing themselves to be used to delay justice.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Haley accuses Biden of giving 'offensive' speech at the church where racist mass shooting occurred",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "Offensive to whom? The Republican party is financing the most offensive presidential candidate since the 1930's in Germany.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump moves to dismiss Georgia election case on presidential immunity grounds",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "Our court system is going to allow Trump to evade all of his crimes against the United States. This is why the citizens need to take matters in their own hands and eliminate him at the polls to save the country.\n\nTop Risk For 2024, from",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Two Capitol Riots. Two Very Different Results.",
                        "outlet_link": "https://www.nytimes.com/",
                        "outlet_name": "The New York Times"
                    },
                    "comments": [
                        {
                            "comment_text": "Can't rely on Evangelicals to exorcise the Devil.",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "We should have learned from Brazil. In our case we relied on the law to handle Trump - what a mistake.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "House GOP releases Hunter Biden contempt resolution",
                        "outlet_link": "https://thehill.com/",
                        "outlet_name": "The Hill"
                    },
                    "comments": [
                        {
                            "comment_text": "Good idea, Trump handed out pardons like candy. Republicans are showing the true meaning \"Weaponization of government\".",
                            "type": "Replied to Vote"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "1.1K",
            "username": "@Jj",
            "nickname": "Jj",
            "post_num": "Posts (2.6K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "Trump suggests unauthorized migrants will vote. The idea stirs his base, but ignores reality",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "Got it! So other words, your situation is hypothetical! Since there is no evidence or very few illegal aliens have ever voted for a President to ever make a difference in the outcome.",
                            "type": "Replied to Edward"
                        },
                        {
                            "comment_text": "So why enforce something that can't be enforce? If businesses continue to hire illegal workers and break federal/state laws because they know the govt. won't do anything. What's the point of the law?",
                            "type": "Replied to Stormy"
                        },
                        {
                            "comment_text": "Ok cupcake. Truth or Dare? I dare you to walk across an American Border Checkpoint without a passport. Let me know how it goes.",
                            "type": "Replied to kevin"
                        },
                        {
                            "comment_text": "Citing the \"for the people Act' is not evidence. You claim there will be illegals voting. But, you couldn't name a single person who illegally voted. Let's hear some names? No? So, you are just speculating? Got it!",
                            "type": "Replied to steve"
                        },
                        {
                            "comment_text": "Got it! You've proved my point. You couldn't even come up with a single name. I mean just one? For goodness sake! LOL",
                            "type": "Replied to GM"
                        },
                        {
                            "comment_text": "What's wrong with it? You are required to show your driver's ID. Is that not enough? Especially, voter frauds have been committed by mainly GOP!\n\nVoter ID is just another form of voter suppression. How much will the Voter",
                            "type": "Replied to Dennis"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Poll: Trump thumping Biden in Michigan — but losing to Whitmer",
                        "outlet_link": "https://www.politico.com/",
                        "outlet_name": "Politico"
                    },
                    "comments": [
                        {
                            "comment_text": "Winning both cases? Got it, he should ask for a speedy trial for the 91 indictments. He's going to win it all, right?",
                            "type": "Replied to Lawrence"
                        },
                        {
                            "comment_text": "Yeah right. A GOP funded poll is accurate. 29-41? When the Democrats make up 40% of the votes and GOP makes up 40% of the votes? LOL Get out of here!",
                            "type": "Replied to Lawrence"
                        },
                        {
                            "comment_text": "No. I don't claim to know the future like you. Cosmic Snoop?",
                            "type": "Replied to Cosmicsnoop"
                        },
                        {
                            "comment_text": "Ok. So, who is your alternative? A twice impeached ex president with 91 federal indictments? Got it! It makes me sooo responsible. LOL",
                            "type": "Replied to Nightlistic"
                        },
                        {
                            "comment_text": "Nice! Another MAGA pulled his handicap card- when you can't debate, pull the \"name calling\" Trash card. LOL",
                            "type": "Replied to dillon"
                        },
                        {
                            "comment_text": "I'm surprise it's not 99.9%. This poll is worthless.",
                            "type": "Replied to thad"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "‘Designed to terrorize’: Maine official who removed Trump from ballot describes recent threats",
                        "outlet_link": "https://www.theguardian.com/international",
                        "outlet_name": "The Guardian"
                    },
                    "comments": [
                        {
                            "comment_text": "No silly. Break some house rules and find out. 😂😜",
                            "type": "Replied to lathrupman"
                        },
                        {
                            "comment_text": "That is true. She is the Secretary of State, who has the responsibility of removing unqualified people due to not meeting age requirement, citizenship, wrong filing forms, and overthrowing of an elected govt. of the United States on Jan 6th.",
                            "type": "Replied to lathrupman"
                        },
                        {
                            "comment_text": "Aww..poor MAGA. When triggered, he had to pull out his handicap card out- name calling. We are so shocked! LOL",
                            "type": "Replied to Noneya"
                        },
                        {
                            "comment_text": "Got it! Thomas is going to vote for Trump no matter what!",
                            "type": "Replied to Stephen"
                        },
                        {
                            "comment_text": "Got it! So other words, you have facts from an alternative world. No problem. Please join the next Qanon JFK sighting rally.",
                            "type": "Replied to mister"
                        },
                        {
                            "comment_text": "Then why is he asking for immunity? Setting up fake electors is official presidential business? I don't think so. . .",
                            "type": "Replied to Shauna"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Maine House votes down GOP effort to impeach election official who removed Trump from ballot",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "Yes, the Southern Democrats who started the civil war. After the civil rights movement, those Southern Democrats switched party to the GOP to align more with their belief's of white nationalism! LOL",
                            "type": "Replied to Maynard"
                        },
                        {
                            "comment_text": "What planet do you live on? Over 750 people are serving prison sentences for Jan 6th. The FBI is still looking for many more! P lease help them if you know those folks!",
                            "type": "Replied to Thomas"
                        },
                        {
                            "comment_text": "Agreed. We may be right or wrong. But we already know that at least one SCOTUS member, Thomas will be voting for. . .",
                            "type": "Replied to Mwright"
                        },
                        {
                            "comment_text": "Have you thought about a career in Comedy? You show promising signs. . .",
                            "type": "Replied to Joel"
                        },
                        {
                            "comment_text": "5 votes thumbs down? What a loser.",
                            "type": "Replied to Ralph"
                        },
                        {
                            "comment_text": "Lame excuse. 14th Amendment doesn't say a \"federal crime\" just participation is enough. If you are looking for evidences of participation, plenty of it! Let's start with fake electors, the rally speech command and control, just",
                            "type": "Replied to allen"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "US Senate Republicans say stopgap needed to avert shutdown, potential problem for Johnson",
                        "outlet_link": "https://www.reuters.com/",
                        "outlet_name": "Reuters"
                    },
                    "comments": [
                        {
                            "comment_text": "Sure. Let's get rid of the $8 trillion in tax cuts for the billionaire. Problem solved.",
                            "type": "Replied to average"
                        },
                        {
                            "comment_text": "No he is not! He is on the Epstein list. We would like to know why?",
                            "type": "Replied to David"
                        },
                        {
                            "comment_text": "y not? Their voters vote them back every term!",
                            "type": "Replied to Twisted"
                        },
                        {
                            "comment_text": "Did you pass 5th grade math? The US budget is $6.1 Trillion. The Ukraine money would last not more than a day to fund the govt. LOL",
                            "type": "Replied to average"
                        },
                        {
                            "comment_text": "This is not a problem. He only needs like two votes from the GOP? The rest of the Democrats will vote for it.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Wisconsin judge rules that absentee voting van used in 2022 was illegal",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "But, it doesn't account for history- The Southern Democratic party switched to GOP during the Civil Rights movement.",
                            "type": "Replied to Niel"
                        },
                        {
                            "comment_text": "Nowhere can this Court find or has been provided any authority allowing the use of a van or vehicle as an alternate absentee voting vehicle,” the judge wrote.\n\nThe judge contradicts his own ruling. He said there was no law that",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Congresswoman Lauren Boebert's ex-husband arrested, facing charges",
                        "outlet_link": "https://www.cbsnews.com/",
                        "outlet_name": "CBS News"
                    },
                    "comments": [
                        {
                            "comment_text": "lol",
                            "type": "Replied to Born"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Everything you need to know about Republicans moving forward on impeaching Homeland Security Secretary Alejandro Mayorkas",
                        "outlet_link": "https://www.businessinsider.com/",
                        "outlet_name": "Business Insider"
                    },
                    "comments": [
                        {
                            "comment_text": "So, the GQP are finally going to pass an immigration reform bill to remove 10 million illegals working on American businesses? Oh never mind, they benefit from their cheap labor.\n\nFlorida is a great example of GQP execution of labor",
                            "type": "Posted"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "7.8K",
            "username": "@FrankN577",
            "nickname": "FrankN",
            "post_num": "Posts (5.5K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "ObamaCare enrollment breaks record for third consecutive year",
                        "outlet_link": "https://thehill.com/",
                        "outlet_name": "The Hill"
                    },
                    "comments": [
                        {
                            "comment_text": "I think we will remember these time as the time when the GOP passed away...",
                            "type": "Replied to Bill"
                        },
                        {
                            "comment_text": "Sounds fake to me...I cant even remember what the price of chocolate pudding was back in 2013...",
                            "type": "Replied to Get"
                        },
                        {
                            "comment_text": "do you even qualify for Obamacare Don?",
                            "type": "Replied to Don"
                        },
                        {
                            "comment_text": "Don you can buy health insurance anytime of the year you want...including July, even Obamacare if you have a qualifying event...like you lost your insurance because you lost your job.",
                            "type": "Replied to Don"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "As House GOP launches effort to impeach Mayorkas, senators want to strike a border deal with him",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "how can you get kicked out of school after school is over and you have gone home...?",
                            "type": "Replied to DanB"
                        },
                        {
                            "comment_text": "you have to be in the US to claim asylum...that's the law",
                            "type": "Replied to Will"
                        },
                        {
                            "comment_text": "first in blaming Joe for the bad weather",
                            "type": "Replied to Jason"
                        },
                        {
                            "comment_text": "There's nobody destroying the country...",
                            "type": "Replied to David"
                        },
                        {
                            "comment_text": "WWIII would necessarily be with numerous countries...have you got a treasure map for the rest of the comment?",
                            "type": "Replied to David"
                        },
                        {
                            "comment_text": "he has to follow the law which is pretty much in line with our values. This is a country that benefits from migrants and immigrants no reason to think that this surge won't be the same...what are you afraid of? The numbers are stressful but",
                            "type": "Replied to Will"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Hunter Biden makes surprise visit to Capitol Hill as GOP takes a first step to hold him in contempt",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "He did show up",
                            "type": "Replied to Toadaly"
                        },
                        {
                            "comment_text": "the GOP has gone well beyond political persecution here...it is predatory behavior. Jordan and Comer are predators hunting down H Biden.",
                            "type": "Replied to Dave"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Congress is trying to dodge a government shutdown. They have to clear 3 hurdles first.",
                        "outlet_link": "https://www.usatoday.com/news/",
                        "outlet_name": "USA TODAY"
                    },
                    "comments": [
                        {
                            "comment_text": "then you vote out the Republicans and fix it the next time...",
                            "type": "Replied to Lori"
                        },
                        {
                            "comment_text": "If it was bipartisan the House would have passed the Biden/McCarthy deal...there are plenty votes in the House to do that. The GOP is failing...we all know why.",
                            "type": "Replied to walter"
                        },
                        {
                            "comment_text": "Congress is too broad a term to use here...its the GOP House that cant get it done. This is attempt #4 to try and get the Republicans to climb down off their high-wire/hair-on-fire act. First was the high-wire President/McCarthy Budget Deal that",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "GOP candidates unworried about Iowa turnout as they face record cold caucus temperatures",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "I'll be looking to see if the Trump's belief that he can have a Seal Team assassinate his political rivals has a chilling effect on his support in Iowa.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Austin kept prostate cancer, surgery complications a secret from everyone, even Biden",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "it depends, who you talk to. Beyond all the complaining I would say one side believes we are recovering from a Pandemic, orderly but unfulfilled. The other side feels their lord and savior Trump has been done wrong and view the world through a",
                            "type": "Replied to Tom"
                        },
                        {
                            "comment_text": "I have feeling that I'm very good at that too...but my dog might be better.",
                            "type": "Replied to Tom"
                        },
                        {
                            "comment_text": "under the covers?",
                            "type": "Replied to AAA"
                        },
                        {
                            "comment_text": "The voices in your head will answer your questions, if they haven't already. If you are still up at the Capitol.... you can make your way home...he isn't going to make it there.",
                            "type": "Replied to Cliff"
                        },
                        {
                            "comment_text": "are you trying to compare your conditions of residency...?",
                            "type": "Replied to Cliff"
                        },
                        {
                            "comment_text": "I aced my cognitive test...",
                            "type": "Replied to Tom"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "‘Pray for those who were injured,’ TX Governor Abbott says after Fort Worth hotel explosion",
                        "outlet_link": "https://www.star-telegram.com/",
                        "outlet_name": "Fort Worth Star-Telegram"
                    },
                    "comments": [
                        {
                            "comment_text": "Great...I'll stop looking on the stove.",
                            "type": "Replied to frank"
                        },
                        {
                            "comment_text": "I cant find the lithium battery on my electric stove...",
                            "type": "Replied to Leatherneck"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "33K",
            "username": "@marky_atl",
            "nickname": "marky_atl",
            "post_num": "Posts (10.4K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "5 Takeaways From the Appeals Court Hearing on Trump’s Immunity Claim",
                        "outlet_link": "https://www.nytimes.com/",
                        "outlet_name": "The New York Times"
                    },
                    "comments": [
                        {
                            "comment_text": "In FEB 1933, the führer goaded his goons into attacking and burning down the Reichstag (Germany’s seat of gov’t). On J6, the orange führer goaded HIS goons into storming and ransacking our nation’s sacred Capitol. NO DIFFERENCE",
                            "type": "Replied to R"
                        },
                        {
                            "comment_text": "And tRump’s political strategies are in alignment with the führer.",
                            "type": "Replied to R"
                        },
                        {
                            "comment_text": "The #1 takeaway: The Constitution does NOT say a president must be impeached and convicted before being indicted. Which means Sauer’s interpretation is TOTALLY false.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "GOP candidates unworried about Iowa turnout as they face record cold caucus temperatures",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "Mail in ballots would end this nightmare. Too bad tRump’s brainwashed trolls can’t understand this.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump warns of 'Pandora's box' of perpetual presidential prosecutions if charges against him stand",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "How is the orange führer any different than his mentor, A_dolf?",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump promotes 'totally baseless' birther conspiracy theory against Nikki Haley",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "Maybe now tRump stooge Haley will take off the kid gloves and start attacking the orange swine.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "iPhone found after falling out of plane",
                        "outlet_link": "https://www.virginiafirst.com",
                        "outlet_name": "WFXR Roanoke"
                    },
                    "comments": [
                        {
                            "comment_text": "Good thing it landed in the grass instead of in the street.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump shifts focus from Iowa to DC federal court",
                        "outlet_link": "https://thehill.com/",
                        "outlet_name": "The Hill"
                    },
                    "comments": [
                        {
                            "comment_text": "Yep, the orange villain actually said he hopes the stock market will crash over the next 12 months. Think about that long and hard if you still support this slimeball. He’s talking about YOUR nest egg.",
                            "type": "Replied to mario"
                        },
                        {
                            "comment_text": "Gonna be nice when the orange mob boss finally becomes a full time resident of the Gray Bar Hotel.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "White House: 'Grotesque' to call Jan. 6 defendants 'hostages'",
                        "outlet_link": "https://www.reuters.com/",
                        "outlet_name": "Reuters"
                    },
                    "comments": [
                        {
                            "comment_text": "OK, I think we’re done here. It takes a certain type of individual to believe the steady stream of lies and BASELESS conspiracy theories emanating from the orange traitor. Someone with a low IQ, extremely gullible, and deeply brain washed. You",
                            "type": "Replied to Central"
                        },
                        {
                            "comment_text": "Sigh…what an excellent deflection, tRump_flake. As if Roe has anything to do with the 60 frivolous “voter fraud” lawsuits. I stand by my statement. Rudy GHOULiani and the orange führer filed DOZENS of lawsuits, which were all dismissed. You can",
                            "type": "Replied to Central"
                        },
                        {
                            "comment_text": "Is that what you learned in your Qanon meeting last night, tRump_flake? Wow, you really took good notes, didn’t ya?",
                            "type": "Replied to tony"
                        },
                        {
                            "comment_text": "Hint: you really should email the SIXTY judges that threw out all the frivolous “voter fraud” lawsuits, due to LACK OF EVIDENCE, and tell them about your theory of rigged voting machines. Be sure and tell them how CLUELESS they are and how SMART",
                            "type": "Replied to tony"
                        },
                        {
                            "comment_text": "Do you even understand the difference between a conspiracy theory and the TRUTH? I’m gonna go out on a limb and say NO.",
                            "type": "Replied to tony"
                        },
                        {
                            "comment_text": "Was that your speech from last night’s Qanon meeting?",
                            "type": "Replied to Stuart"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "10K",
            "username": "@DwayneHoover",
            "nickname": "Dwayne Hoover",
            "post_num": "Posts (7.3K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "Trump can’t speak during closing arguments in NY civil fraud trial, judge says",
                        "outlet_link": "https://www.cnn.com/",
                        "outlet_name": "CNN"
                    },
                    "comments": [
                        {
                            "comment_text": "Excellent",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "5 Takeaways From the Appeals Court Hearing on Trump’s Immunity Claim",
                        "outlet_link": "https://www.nytimes.com/",
                        "outlet_name": "The New York Times"
                    },
                    "comments": [
                        {
                            "comment_text": "No immunity and no delays",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Judges skeptical of Trump's immunity claim in election subversion case",
                        "outlet_link": "https://www.reuters.com/",
                        "outlet_name": "Reuters"
                    },
                    "comments": [
                        {
                            "comment_text": "Whatever",
                            "type": "Replied to pat"
                        },
                        {
                            "comment_text": "Whatever, PatIsNotTheSharpestKnifeInTheDrawer posting ridiculous GIFs",
                            "type": "Replied to pat"
                        },
                        {
                            "comment_text": "You look ridiculous",
                            "type": "Replied to pat"
                        },
                        {
                            "comment_text": "Whatever... dismissed",
                            "type": "Replied to pat"
                        },
                        {
                            "comment_text": "Nonsense, no past president has \"engaged in insurrection or rebellion\"... t-Rump is a insurrectionist and fraudster, conman, pathological liar, misogynist, sex-offender... the list goes on and on",
                            "type": "Replied to pat"
                        },
                        {
                            "comment_text": "PatKnowsNothing about US history, the US Constitution or US law; what a shame. Come back when you do.",
                            "type": "Replied to pat"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "GOP candidates unworried about Iowa turnout as they face record cold caucus temperatures",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "National Review, a conservative publication, headline January 10, 2024, today ...\n\nRepublican Voters Can — and Should — Rethink Nominating Trump",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Ray Epps, a target of Jan. 6 conspiracy theories, gets a year of probation for his Capitol riot role",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "No you are not",
                            "type": "Replied to Schur"
                        },
                        {
                            "comment_text": "The Orange Cult has created space in between your ears",
                            "type": "Replied to Schur"
                        },
                        {
                            "comment_text": "PullShirt, just another MAGA Cult conspiracy theory",
                            "type": "Replied to Schur"
                        },
                        {
                            "comment_text": "He was charged with a misdemeanor because\n\nhe did not enter the capitol\n\nhe did not assault anyone\n\nhe did not damage any property\n\nHe turned himself in",
                            "type": "Replied to Schur"
                        },
                        {
                            "comment_text": "No it doesn't",
                            "type": "Replied to Schur"
                        },
                        {
                            "comment_text": "and Donkey's fly",
                            "type": "Replied to Perfect"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Appeals Court Seems Skeptical of Trump’s Immunity Claim",
                        "outlet_link": "https://www.nytimes.com/",
                        "outlet_name": "The New York Times"
                    },
                    "comments": [
                        {
                            "comment_text": "There are no facts in your post to dispute. You obviously know nothing about law. The immunity issue is about when performing presidential duties... for example, a president has immunity when he orders a strike against a terrorist, e.g. Osama Bin",
                            "type": "Replied to Alan"
                        },
                        {
                            "comment_text": "another poster with CLS, caps-lock-syndrome",
                            "type": "Replied to Alan"
                        },
                        {
                            "comment_text": "If only Tim had credibility",
                            "type": "Replied to Rouge"
                        },
                        {
                            "comment_text": "No, t-Rump does not \"think\" at all",
                            "type": "Replied to Carl"
                        },
                        {
                            "comment_text": "Judges and People with more than Half a Brain Seem Skeptical of Trump’s Claim of Immunity\n\nHeadline edited for clarity and accuracy",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump legal news brief: In reversal, Judge Engoron says Trump can’t give his own closing argument in fraud trial",
                        "outlet_link": "https://news.yahoo.com/",
                        "outlet_name": "Yahoo News"
                    },
                    "comments": [
                        {
                            "comment_text": "t-Rump is proof you can't fix qupid... I hope it's televised!",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "NancyIsAnIdiot says it all",
                            "type": "Replied to Nancy"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Everything you need to know about Republicans moving forward on impeaching Homeland Security Secretary Alejandro Mayorkas",
                        "outlet_link": "https://www.businessinsider.com/",
                        "outlet_name": "Business Insider"
                    },
                    "comments": [
                        {
                            "comment_text": "MAGA t-Rumplicans are proof you can't fix qupid",
                            "type": "Posted"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "18.5K",
            "username": "@NoW",
            "nickname": "NoW",
            "post_num": "Posts (5.4K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "Video appears to show the Israeli army shot 3 Palestinians, killing 1, without provocation",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "Well, Sam, you know where your local shelter is, waddle on down and give them some money...In fact, give me your address and I'll send you a few bucks.",
                            "type": "Replied to SAM"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "\"You have no balls\": GOP blasted over complaints after Hunter Biden crashes House hearing",
                        "outlet_link": "https://www.salon.com/",
                        "outlet_name": "Salon"
                    },
                    "comments": [
                        {
                            "comment_text": "We all know why the GOP doesn't want the hearing televised.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Nevada judge rejects Trump ballot eligibility challenge, says GOP opponent 'improperly manufactured' standing",
                        "outlet_link": "https://www.foxnews.com/",
                        "outlet_name": "Fox News"
                    },
                    "comments": [
                        {
                            "comment_text": "Russian bot reported",
                            "type": "Replied to Steven"
                        },
                        {
                            "comment_text": "According to the judge, unless you were in the Capitol on 6 Jan and got smacked in the face, you don't have standing.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump dodges question on whether he will tell his supporters “no violence” if he loses the election amid criminal cases.",
                        "outlet_link": "https://therecount.com/",
                        "outlet_name": "The Recount"
                    },
                    "comments": [
                        {
                            "comment_text": "With the con-job they're getting from their Trump and other GOP \"thought leaders\", there might be instances of armed rebellion by MAGAs. And it will end the way that Shay's Rebellion, the Coal Wars, Weathermen/SDS, etc. with the",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "It sure looks like Donald Trump was disguised as 'Doe 174' in the newly unsealed Jeffrey Epstein documents",
                        "outlet_link": "https://www.insider.com/",
                        "outlet_name": "Business Insider"
                    },
                    "comments": [
                        {
                            "comment_text": "Whether the names are Clinton or Trump or Smth, it was wrong to release this so the simple people could get their celebrity gossip jollies. It serves no legal purpose.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "“Dead man walking”: Experts say Trump immunity lawyer lost judges after he “set a trap for himself”",
                        "outlet_link": "https://www.salon.com/",
                        "outlet_name": "Salon"
                    },
                    "comments": [
                        {
                            "comment_text": "Trump's lawyers remind why we should heed the advice of Shakespeare's D1 c k the Butcher",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "As DeSantis and Haley face off in Iowa GOP debate, urgency could spark fireworks",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "In our McKinney TX neighborhood in July a Doug Burgum sign appeared in a yard. In mid August 3 yards had signs and in Sept there were 7 signs in yards on my street. Although Burgum dropped out months ago, yesterday I noticed there was still one",
                            "type": "Posted"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "23.3K",
            "username": "@Saa7652",
            "nickname": "S",
            "post_num": "Posts (8.6K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "Hunter Biden makes surprise appearance on Capitol Hill",
                        "outlet_link": "https://www.cbsnews.com/",
                        "outlet_name": "CBS News"
                    },
                    "comments": [
                        {
                            "comment_text": "Presidents can assassinate someone without charges, Presidents sons can just shirk the law in general. Learn your facts, Jethro.",
                            "type": "Replied to E"
                        },
                        {
                            "comment_text": "too bad there's no evidence. I heard he went to the moon as a child, but DOGGONE IT, there's no evidence of that either. What are we to do? Oh yeah, we can pretend we have evidence to pacify our ignorant cult. PROBLEM SOLVED. NEXT ",
                            "type": "Replied to J"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "College enrollment could take a big hit in 2025. Here’s why.",
                        "outlet_link": "https://thehill.com/",
                        "outlet_name": "The Hill"
                    },
                    "comments": [
                        {
                            "comment_text": "I wouldn't fret. you wouldn't have gotten into college anyway.",
                            "type": "Replied to Karl"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Ramaswamy insists he’s still in the game as he fails to qualify for last debate",
                        "outlet_link": "https://www.theguardian.com/international",
                        "outlet_name": "The Guardian"
                    },
                    "comments": [
                        {
                            "comment_text": "I guess he couldn't charm enough snakes.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump warns of ‘bedlam’ if criminal cases bar him from White House",
                        "outlet_link": "https://www.theguardian.com/international",
                        "outlet_name": "The Guardian"
                    },
                    "comments": [
                        {
                            "comment_text": "It's always bedlam in the Trump cult. the recipe: Take a group of whiskey tangos that know nothing about Civics. Make them angry with lies about political opponents. Stir in a large portion of racism. Bake forever in a news bubble until ",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "5 Takeaways From the Appeals Court Hearing on Trump’s Immunity Claim",
                        "outlet_link": "https://www.nytimes.com/",
                        "outlet_name": "The New York Times"
                    },
                    "comments": [
                        {
                            "comment_text": "So Trump says he can't be prosecuted for ANYTHING because it's all political. unless he's successfully prosecuted FIRST through Impeachment. Which is BY DESIGN political. When impeached Trump's says it's unfair because ",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "GOP candidates unworried about Iowa turnout as they face record cold caucus temperatures",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "The Trump cult stay warm with copious amounts of fortified wine as they do every night.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Congress is trying to dodge a government shutdown. They have to clear 3 hurdles first.",
                        "outlet_link": "https://www.usatoday.com/news/",
                        "outlet_name": "USA TODAY"
                    },
                    "comments": [
                        {
                            "comment_text": "It'll be okay, Mike Johnson has his right hand man God on it telling him what to do. so don't bother paying attention TRUMP cult, GOD is on the budget crisis. God will be on the next budget crisis too in the Spring. Soon Mike Johnson and ",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Deadly storm sends water levels skyrocketing on Northeast rivers and at the coast, forcing evacuations",
                        "outlet_link": "https://www.cnn.com/",
                        "outlet_name": "CNN"
                    },
                    "comments": [
                        {
                            "comment_text": "Why should I be forced to read about some liberal's biased story attempting to brainwash wAsh me to their global warming agenda masquerading as \"weather news\"? Full disclosure: I am an illiterate Trump culter so paranoid I see ",
                            "type": "Posted"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "12K",
            "username": "@Amy36286",
            "nickname": "Amy",
            "post_num": "Posts (4.2K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "Fact Check: Biden Proposed a Border Fence in 2007, Saying No Great Nation Has Uncontrolled Borders",
                        "outlet_link": "https://www.snopes.com/",
                        "outlet_name": "Snopes"
                    },
                    "comments": [
                        {
                            "comment_text": "Green Acres with Biden and Harris\n\n(joe)GREEN ENERGY is the place to be.\n\nEnding fossil fuels is the life for me.\n\nInflation spread out so far and wide\n\nLike a Chinese balloon viewing our",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "( Beverly Hill Billy's(yahoo) music )\n\nLet me tell you a story about a man name Joe\n\nHad himself a son that caused his family woes\n\nThen one year Hunter smoked too much crack.\n\nTotally forgot to get his laptop",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Jonathan Turley breaks down the 'tough question' for Trump's immunity case",
                        "outlet_link": "http://www.foxnews.com/",
                        "outlet_name": "FOX News Videos"
                    },
                    "comments": [
                        {
                            "comment_text": "I agree that I will vote opposite liberal progressive. It doesn't matter who. A former Democrat. I have the whole west coast as an example why....",
                            "type": "Replied to Ron"
                        },
                        {
                            "comment_text": "Okay whatever you crack who-are Ken. Hung like him too.",
                            "type": "Replied to scott"
                        },
                        {
                            "comment_text": "Keep thinking that. The inner city rejects are funny.\n\nPresident Donald J. Trump.\n\nWhy? Because I'll vote opposite liberal inner city garbage can kids every time.\n\nA former Democrat. Don't know of 1 person who says",
                            "type": "Replied to Digital"
                        },
                        {
                            "comment_text": "The inner city retodd has spoken.",
                            "type": "Replied to T"
                        },
                        {
                            "comment_text": "( Beverly Hill Billy's(yahoo) music )\n\nLet me tell you a story about a man name Joe\n\nHad himself a son that caused his family woes\n\nThen one year Hunter smoked too much crack.\n\nTotally forgot to get his laptop",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "Green Acres with Biden and Harris\n\n(joe)GREEN ENERGY is the place to be.\n\nEnding fossil fuels is the life for me.\n\nInflation spread out so far and wide\n\nLike a Chinese balloon viewing our",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "GOP candidates unworried about Iowa turnout as they face record cold caucus temperatures",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "The right to rob a grandmother, shoot a Christian, loot a store, beat an ex, car jacking a mother with kids in the car and allowing millions of illegals are also at stake.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "DeSantis and Haley go head to head: How to watch the fifth Republican presidential debate",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "I wonder what you wrote twice and got rejected.",
                            "type": "Replied to MeatFlaps"
                        },
                        {
                            "comment_text": "Please explain the racism? Where?\n\nWatch out for the catch 22 question.",
                            "type": "Replied to MeatFlaps"
                        },
                        {
                            "comment_text": "The right to rob a grandmother, shoot a Christian, loot a store, beat an ex, car jacking a mother with kids in the car and allowing millions of illegals are also at stake.\n\nPlease run from the police with something shiny in one hand.",
                            "type": "Replied to The"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Body found in same Houston home where a rapper allegedly held a woman captive for years",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "If the dead were liberal was a crime committed in liberal lands?",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "CNN anchor’s breast cancer diagnosis turns spotlight on striking racial disparity",
                        "outlet_link": "https://www.cnn.com/",
                        "outlet_name": "CNN"
                    },
                    "comments": [
                        {
                            "comment_text": "I think our forefathers would agree with me.",
                            "type": "Replied to Dan"
                        },
                        {
                            "comment_text": "She votes for the harming of Americans and their businesses with no consequences for the offender. Have a nice afterlife.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Top Wall Street Analyst Predicts Joe Biden's Future — And Yikes",
                        "outlet_link": "https://www.huffpost.com",
                        "outlet_name": "HuffPost"
                    },
                    "comments": [
                        {
                            "comment_text": "( Beverly Hill Billy's(yahoo) music )\n\nLet me tell you a story about a man name Joe\n\nHad himself a son that caused his family woes\n\nThen one year Hunter smoked to much crack.\n\nTotally forgot to get his laptop",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "Green Acres with Biden and Harris\n\n(joe)GREEN ENERGY is the place to be.\n\nEnding fossil fuels is the life for me.\n\nInflation spread out so far and wide\n\nLike a Chinese balloon viewing our",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Comer warns Garland over handling of potential Hunter Biden contempt resolution",
                        "outlet_link": "https://thehill.com/",
                        "outlet_name": "The Hill"
                    },
                    "comments": [
                        {
                            "comment_text": "Green Acres with Biden and Harris\n\n(joe)GREEN ENERGY is the place to be.\n\nEnding fossil fuels is the life for me.\n\nInflation spread out so far and wide\n\nLike a Chinese balloon viewing our",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "( Beverly Hill Billy's(yahoo) music )\n\nLet me tell you a story about a man name Joe\n\nHad himself a son that caused his family woes\n\nThen one year Hunter smoked to much crack.\n\nTotally forgot to get his laptop",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "(Happy Days original music)The Hunter Biden song.\n\n1, 2, 3 o'clock 4 o'clock Rocks\n\n5, 6, 7 o'clock 8 o'clock Rocks\n\n9, 10 11 o'clock 12 o'clock Rocks\n\nWe're going to do Rocks around the",
                            "type": "Posted"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "11.3K",
            "username": "@gaa66980",
            "nickname": "gw",
            "post_num": "Posts (3.3K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "Videos surface of large group sexually assaulting toddlers in Texas mall, FBI says",
                        "outlet_link": "https://www.star-telegram.com/",
                        "outlet_name": "Fort Worth Star-Telegram"
                    },
                    "comments": [
                        {
                            "comment_text": "I always suspected that the PizzaGate conspiracy was real, but instead of Democrats in DC, it was run out of a Texas rib joint owned by Cruz, Abbott and Paxton. Here's proof.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "As DeSantis and Haley face off in Iowa GOP debate, urgency could spark fireworks",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "These fascist traitors really are, aren't they?",
                            "type": "Replied to DonW"
                        },
                        {
                            "comment_text": "It's a toss-up as to which fascist groveler will be the next lynching victim of the traitor tRump's supporters. Neither will be smart enough to run scared like the toddler Hawley.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Judge rescinds permission for Trump to give his own closing argument at his civil fraud trial",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "This is a tragedy. Psychiatrists studying depraved and delusional behavior, not to mention legal scholars and comedians, are depressed at all the lost data and unmined comic treasure.",
                            "type": "Posted"
                        },
                        {
                            "comment_text": "Take away his fraudulent nature and his lies and he has and is nothing. I'd call him a 'Nothing Man\" but that would be disingenuously attributing masculinity where there is an obvious emptiness that is void of any shred of decency and",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Elon Musk fired back at a Wall Street Journal story about his drug use. Experts say the reported combination of substances would be hugely risky if true.",
                        "outlet_link": "https://www.insider.com/",
                        "outlet_name": "Business Insider"
                    },
                    "comments": [
                        {
                            "comment_text": "Allowing this sociopath any access to any aspect of our national security is as dangerous as letting the fascist traitor tRump anywhere near anything that demands accountability.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "GOP candidates unworried about Iowa turnout as they face record cold caucus temperatures",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "MAGA mutants are blaming the weather on COVID vaccinations and teacher's unions.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Hunter Biden Abruptly Exits Hearing As Marjorie Taylor Greene Starts Speaking",
                        "outlet_link": "https://www.huffpost.com",
                        "outlet_name": "HuffPost"
                    },
                    "comments": [
                        {
                            "comment_text": "Strict adherence to avoiding the ignorant snide that is the liar Perjury Taylor Greene is intelligent preventive mental health care.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "\"Suicide for the GOP\": Republicans freak out after \"f**king idiots\" push to oust House speaker again",
                        "outlet_link": "https://www.salon.com/",
                        "outlet_name": "Salon"
                    },
                    "comments": [
                        {
                            "comment_text": "As if sane and moral America didn't already despise The Freedom for Fascists Caucus for it's lack of democratic principles, Buffalo Chip Roy puts an ugly face on the traitorous cartel that exacerbates their societal perversions.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump promotes 'totally baseless' birther conspiracy theory against Nikki Haley",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "Yahoo censors comments including the tRump family name when they immigrated two generations ago. It begins with \"D \" instead of \"T\" and ends with a \"pf\" with \"rum\" in the middle. tRump is two whiskers from being a",
                            "type": "Posted"
                        }
                    ]
                }
            ]
        },
        {
            "likes": "8.6K",
            "username": "@cixelsyd",
            "nickname": "cixelsyd",
            "post_num": "Posts (1.3K)",
            "comments_section": [
                {
                    "source_article": {
                        "title": "Trump can't deliver closing argument in New York civil fraud trial, judge rules",
                        "outlet_link": "https://www.cbsnews.com/",
                        "outlet_name": "CBS News"
                    },
                    "comments": [
                        {
                            "comment_text": "The judge required Trump to present facts. Trump's lawyers consider that as unreasonable. Good luck to those lawyers with any future appeals of the verdict.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "5 Takeaways From the Appeals Court Hearing on Trump’s Immunity Claim",
                        "outlet_link": "https://www.nytimes.com/",
                        "outlet_name": "The New York Times"
                    },
                    "comments": [
                        {
                            "comment_text": "The difference is Biden isn't an unhinged druggie lunatic like Trump and would abide by the US Constitution like every other president in US history other than one facing over 90 criminal charges.",
                            "type": "Replied to conieberay"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "GOP candidates unworried about Iowa turnout as they face record cold caucus temperatures",
                        "outlet_link": "https://www.nbcnews.com/",
                        "outlet_name": "NBC News"
                    },
                    "comments": [
                        {
                            "comment_text": "\"Their people\" ... from someone running for leadership of the UNITED States of America.\n\nStandard division and hatred speech from Trump doing his job as Putin's \"useful id iot\" to destroy the USA from within.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump suggests unauthorized migrants will vote. The idea stirs his base, but ignores reality",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "Fitting.\n\nHis base ignores reality.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Trump downplays Jan. 6 on the anniversary of the Capitol siege and calls jailed rioters 'hostages'",
                        "outlet_link": "https://apnews.com/",
                        "outlet_name": "Associated Press"
                    },
                    "comments": [
                        {
                            "comment_text": "Becoming more delusional every day. Lifelong drug abuse always catches up.",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "RNC supports Trump in 14th Amendment case at the Supreme Court",
                        "outlet_link": "https://www.politico.com/",
                        "outlet_name": "Politico"
                    },
                    "comments": [
                        {
                            "comment_text": "Interesting that there is no mention of the \"historically unprecedented violent insurrection attempt to overthrow a democratically elected government in which people died\". Pretty clear here that the Republicans are banking on favorable",
                            "type": "Posted"
                        }
                    ]
                },
                {
                    "source_article": {
                        "title": "Nikki Haley town hall takeaways: GOP candidate on mental health -- and Trump 'chaos'",
                        "outlet_link": "https://www.usatoday.com/news/",
                        "outlet_name": "USA TODAY"
                    },
                    "comments": [
                        {
                            "comment_text": "While she's not openly nearly as disgusting as Trump it's obvious she shares the same fascist racist homophobic views. She conducts herself a lot like Mike Pence in the way you never really know where she stands. She avoids providing",
                            "type": "Posted"
                        }
                    ]
                }
            ]
        }
    ]
]